# Brewfile
# A list of the developer machine's dependencies from Homebrew
# https://github.com/Homebrew/homebrew-bundle
#
# Usage:
#
#    $ brew bundle
#
# IMPORTANT: Remember to scroll back through the installation
# log so you can read all the caveats. Otherwise, you might
# forget to do things like set up the LaunchAgents.
#

cask_args appdir: '/Applications'

brew 'ack'
brew 'bash-completion'
brew 'cmake'
brew 'git'
brew 'memcached'
brew 'openssl'
brew 'postgresql'
brew 'redis'
brew 'rbenv'
brew 'ruby-build'
brew 'ssh-copy-id'
brew 'tree'
brew 'wget'

# Homebrew Cask
# http://caskroom.io

tap 'caskroom/cask'

cask '1password'
cask 'alfred'
cask 'atom'
cask 'coderunner'
cask 'diffmerge'
cask 'docker'
cask 'dropbox'
cask 'google-chrome'
cask 'sourcetree'
cask 'visual-studio-code'

# Font Casks
# https://github.com/caskroom/homebrew-fonts

tap 'caskroom/fonts'

cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro'

# Corporate

cask 'squidman'

# ruby-perftools profiler

brew 'p7zip'
brew 'graphviz'
brew 'ghostscript'


# Specific Application Development

brew 'exiv2'
brew 'mysql'
brew 'libevent'
brew 'imagemagick@6', link: true
brew 'libcouchbase'
brew 'nvm'

# React Native Development

brew 'watchman'

# Android Development
cask 'caskroom/versions/java8'
brew 'ant'
brew 'maven'
brew 'gradle'
cask 'android-sdk'
cask 'android-ndk'
cask 'intel-haxm'

# iOS Development
mas 'Xcode', id: 497799835