# Brewfile
# A list of the developer machine's dependencies from Homebrew
# https://github.com/Homebrew/homebrew-bundle
#
# Usage:
#
#    $ brew bundle
#
# IMPORTANT: Remember to scroll back through the installation
# log so you can read all the caveats. Otherwise, you might
# forget to do things like set up the LaunchAgents.
#

cask_args appdir: '/Applications'

brew 'ack'
brew 'bash-completion'
brew 'cmake'
brew 'git'
brew 'memcached'
brew 'openssl'
brew 'ssh-copy-id'
brew 'tree'
brew 'wget'
brew 'tmux'
brew 'neovim'
brew 'ripgrep'
brew 'zoxide'
brew 'eza'

# Homebrew Cask
# http://caskroom.io

cask 'abstract'
cask 'aerial'
cask 'alfred'
cask 'cheatsheet'
cask 'coderunner'
cask 'diffmerge'
brew 'colima'
cask 'dropbox'
cask 'google-chrome'
cask 'jiggler'
cask 'microsoft-office'
cask 'omnidisksweeper'
cask 'obsidian'
cask 'qlmarkdown'
cask 'rectangle'
cask 'sequel-pro'
cask 'slack'
cask 'sourcetree'
cask 'soulver'
cask 'tweetbot'
cask 'typora'
cask 'ultimaker-cura'
cask 'visual-studio-code'

tap 'homebrew/cask-versions'
cask '1password6'

# Font Casks
# https://github.com/caskroom/homebrew-fonts

#tap 'caskroom/fonts'

#cask 'font-open-sans'
#cask 'font-roboto'
#cask 'font-source-code-pro'

# Corporate

# cask 'skype-for-business'
cask 'microsoft-teams'

# ruby-perftools profiler

brew 'p7zip'
brew 'graphviz'
brew 'ghostscript'


# Specific Application Development

#brew 'nvm' # install directly instead


#Load and start the MySQL service : $ brew services start mysql@5.7
#Expected output : Successfully started mysql (label: homebrew.mxcl.mysql)
#
#Check of the MySQL service has been loaded : $ brew services list
#
#Force link 5.7 version - $ brew link mysql@5.7 --force
#
#Verify the installed MySQL instance : $ mysql -V
#Expected output : Ver 14.14 Distrib 5.7.22, for osx10.13 (x86_64)

# Services
tap 'homebrew/services'


# React Native Development

#brew 'watchman'

# Android Development
#cask 'caskroom/versions/java8'
#brew 'ant'
#brew 'maven'
#brew 'gradle'
#cask 'android-sdk'
#cask 'android-ndk'
#cask 'intel-haxm'

# iOS Development
#mas 'Xcode', id: 497799835

# non brew checklist
#https://github.com/skleinei/alfred-confluence
