# Brewfile
# A list of the developer machine's dependencies from Homebrew
# https://github.com/Homebrew/homebrew-bundle
#
# Usage:
#
#    $ brew bundle
#
# IMPORTANT: Remember to scroll back through the installation
# log so you can read all the caveats. Otherwise, you might
# forget to do things like set up the LaunchAgents.
#

cask_args appdir: '/Applications'

brew 'ack'
brew 'bash-completion'
brew 'cmake'
brew 'git'
brew 'memcached'
brew 'openssl'
brew 'postgresql'
brew 'redis'
brew 'rbenv'
brew 'ruby-build'
brew 'ssh-copy-id'
brew 'tree'
brew 'wget'

# Homebrew Cask
# http://caskroom.io


cask 'aerial'
cask 'alfred'
cask 'coderunner'
cask 'diffmerge'
cask 'docker'
cask 'dropbox'
cask 'google-chrome'
cask 'microsoft-office'
cask 'slack'
cask 'sourcetree'
cask 'typora'
cask 'visual-studio-code'

tap 'homebrew/cask-versions'

cask '1password6'

# Font Casks
# https://github.com/caskroom/homebrew-fonts

#tap 'caskroom/fonts'

#cask 'font-open-sans'
#cask 'font-roboto'
#cask 'font-source-code-pro'

# Corporate

cask 'skype-for-business'

# ruby-perftools profiler

brew 'p7zip'
brew 'graphviz'
brew 'ghostscript'


# Specific Application Development

#brew 'exiv2'
#brew 'mysql'
#brew 'libevent'
#brew 'libcouchbase'
brew 'nvm'

# React Native Development

#brew 'watchman'

# Android Development
#cask 'caskroom/versions/java8'
#brew 'ant'
#brew 'maven'
#brew 'gradle'
#cask 'android-sdk'
#cask 'android-ndk'
#cask 'intel-haxm'

# iOS Development
#mas 'Xcode', id: 497799835
